app/views/shops/_index.html.erb

      <a href= <%= 'shops/' + shop.id.to_s%>>
        <% if shop.pictures.size > 0 %>
---
SELECT COUNT(*) FROM "pictures"  WHERE "pictures"."shop_id" = $1  [["shop_id", 1]]