app/views/shops/_pictures.html.erb

<div class="row">
<% @shop.pictures.each do |picture| %>
---
SELECT "pictures".* FROM "pictures"  WHERE "pictures"."shop_id" = $1  [["shop_id", 1]]