app/views/shops/show.html.erb

  Shop owner: <br>
  <%= @shop.user.first_name %> <%= @shop.user.last_name %> <br>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 7  ORDER BY "users"."id" ASC LIMIT 1

<div class= "pictures col-xs-12">
  <% @shop.pictures.each do |picture| %>
---
SELECT "pictures".* FROM "pictures"  WHERE "pictures"."shop_id" = $1  [["shop_id", 4]]