app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
  def index
    @shops = Shop.all

INSERT INTO "shops" ("city", "country", "created_at", "description", "name", "price", "street_address", "updated_at", "user_id", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @shop = Shop.new(shop_params)
    authorize @shop
    @shop.save

DELETE FROM "shops" WHERE "shops"."id" = $1  [["id", 2]]
---
  def destroy
    @shop.destroy!

SELECT  "shops".* FROM "shops"  WHERE "shops"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_shop
      @shop = Shop.find(params[:id])